--- a/docs/setting-up/index.md
+++ b/docs/setting-up/index.md
@@ -2,14 +2,20 @@
 
 There are three stages to installing and setting up PMM.
 
-```mermaid
-graph LR
-1(Set up PMM Server)-->2(Set up PMM Client)-->3(Add services)
+```plantuml
+@startuml
+!include docs/_images/plantuml_styles.puml
+rectangle "Set up a PMM Server" as SERVER
+rectangle "Set up PMM Client(s)" as CLIENT
+rectangle "Add services" as SERVICES
+SERVER -right->> CLIENT
+CLIENT -right->> SERVICES
+@enduml
 ```
 
-## Set up PMM Server {: #setting-up-pmm-server}
+## Set up PMM Server
